wdi_radio_rails/app/controllers/song_controller.rb

SELECT "songs".* FROM "songs"
---
	def index
		@song = Song.all