app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"  ORDER BY "songs"."artist" ASC, "songs"."album_art" ASC
---
  def index
    @songs = Song.all.order(:artist, :album_art)

INSERT INTO "songs" ("title", "audio_url", "artist", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "xvxc"], ["audio_url", "xcvxcv"], ["artist", "xcvxcv"], ["genre", "xvcxv"], ["created_at", "2015-12-18 13:37:44.388262"], ["updated_at", "2015-12-18 13:37:44.388262"]]
---
  def create
    @song = Song.new(song_params)
    if @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 90]]
UPDATE "songs" SET "title" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["title", "Cripssdcdsdcsvd"], ["updated_at", "2015-12-18 00:52:13.286572"], ["id", 90]]
---
  def update
    @song = Song.find(params[:id])
    if @song.update(song_params)

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 2]]
---
  def destroy
    @song = Song.find(params[:id])
    if @song.destroy