app/controllers/song_controller.rb

	def index
		@song = Song.all
---
SELECT "songs".* FROM "songs"